LouisPauchet/open-renewable-lab/sdkconfig.defaults
# Common settings for every supported target/board variant. Target-
# specific settings (flash size, PSRAM, console) live in
# sdkconfig.defaults.<target> (ESP-IDF merges them automatically based
# on `idf.py set-target`) - see sdkconfig.defaults.esp32s3 (Walter,
# production) and sdkconfig.defaults.esp32 (generic ESP32 DevKit,
# hardware-less test rig - see board_pins.h's BOARD_VARIANT_* Kconfig
# choice).

# Default target if `idf.py set-target` is never run explicitly. The
# project's primary/production target is the Walter module (ESP32-S3);
# run `idf.py set-target esp32` for the DevKit test rig.
CONFIG_IDF_TARGET="esp32s3"

# No OTA in v1 - single factory app, larger NVS for the config blob + SPA assets in flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS / watchdog tuning - generous timeout since SDI-12 measurement
# commands can legitimately take several seconds; panic+reboot (rather
# than just log) on a genuine hang, appropriate for an unattended field
# deployment. Only the steady-timing tasks (aggregation, SD writer,
# MQTT publish) are registered with the watchdog - the SDI-12/I2C bus
# scheduler tasks have inherently variable, sensor-dependent blocking
# time and are deliberately left unregistered to avoid false trips.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_PANIC=y

# Networking
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# Power management: DISABLED again, pending investigation.
#
# CONFIG_PM_ENABLE + CONFIG_FREERTOS_USE_TICKLESS_IDLE (automatic light
# sleep) were enabled earlier this session for battery/solar power
# saving, with esp_pm_configure() in app_main.c doing the actual
# min/max-frequency + light-sleep setup. Real hardware then reproduced a
# permanent hang right after "sampling engine started" - reliably, with
# every other variable ruled out (reverted every other change made this
# session, erased NVS config back to factory defaults, removed the SD
# card, tested on a bare Walter module and on a full Walter Feels
# assembly, with and without a battery) - pointing at sd_logger_init()
# (the next synchronous call in app_main() after that log line, and the
# first one doing real timing-sensitive hardware waiting: an SDMMC
# command/response cycle, even on a mount attempt that's about to fail
# because no card is present). Leading theory, NOT YET CONFIRMED: the
# SDMMC driver doesn't hold a PM lock across that wait, so automatic
# light sleep can trigger mid-transaction, the clocks the peripheral's
# state machine depends on shift under it, and a normally-bounded
# timeout never completes. Disabled here to test that theory - if a
# build with this off boots cleanly again, that confirms it, and a
# follow-up should either scope light sleep more narrowly (e.g. only
# after sd_logger_init() has completed) or find the right PM lock to
# hold around SDMMC access, rather than leaving power saving off for
# good. CONFIG_PM_ENABLE=y / CONFIG_FREERTOS_USE_TICKLESS_IDLE=y is what
# to restore once that's sorted out.
# CONFIG_PM_ENABLE is not set
# CONFIG_FREERTOS_USE_TICKLESS_IDLE is not set

# cJSON (via the espressif/cjson managed component - no longer bundled
# in-tree as a "json" component in this ESP-IDF version) is used by
# config_store for the NVS-backed config blob, and throughout the REST
# API/MQTT payloads. Its own Kconfig (CJSON_NESTING_LIMIT/
# CJSON_CIRCULAR_LIMIT) defaults are fine as-is.

# Heap corruption diagnostics: wraps every heap allocation with canary
# bytes checked on free/realloc, so a buffer overflow (or an
# undersized-stack task overrunning into an adjacent heap block) panics
# with the actual overrun allocation's address at the point it's next
# freed - instead of, as happened on real hardware, an unrelated
# tlsf_malloc() call much later hitting corrupted free-list metadata
# with no indication of what caused it. Meaningful RAM/CPU overhead
# (each allocation grows by ~14 bytes and free()/realloc() do a canary
# check) - fine for bring-up, worth revisiting once hardware bring-up
# is stable.
CONFIG_HEAP_POISONING_COMPREHENSIVE=y

# The ESP-IDF default (3584B) overflows during app_main()'s synchronous
# init - PSA Crypto's driver-dispatch call chain (used by config_store's
# password hashing, see hash_with_salt()) is noticeably deeper than the
# legacy mbedtls_sha256_* API it replaced, and app_main also does
# WiFi/HTTP-server/cJSON work before any of that init hands off to its
# own task. Confirmed via a real stack-overflow panic in task "main" on
# first hardware boot.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
